12/data/attachments/d7674fe6eef910f9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Daniel_peace_Friend_2666_4</nif:username>
            <nif:friendToBeRequested>soap_friends_cd858865-2cf8-4dd2-bca7-fd02ca950a17</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>